In [7]:
import pandas as pd

In [8]:
url = "https://archive.ics.uci.edu/ml/machine-learning-databases/pima-indians-diabetes/pima-indians-diabetes.data"

In [10]:
df=pd.read_csv(url,header=None,names=['col1','col2','col3','col4','col5','col6','col7','col8'])

# select

In [14]:
df.head()

   col1  col2  col3  col4  col5   col6  col7  col8
6   148    72    35     0  33.6  0.627    50     1
1    85    66    29     0  26.6  0.351    31     0
8   183    64     0     0  23.3  0.672    32     1
1    89    66    23    94  28.1  0.167    21     0
0   137    40    35   168  43.1  2.288    33     1

In [78]:
df['col1'].to_frame().head()

   col1
6   148
1    85
8   183
1    89
0   137

# filter

In [6]:
df.query('col1 < 50 & col3 >20')

   col1  col2  col3  col4  col5   col6  col7  col8
1     0    68    35     0  32.0  0.389    22     0
5     0    80    32     0  41.0  0.346    37     1
6     0    68    41     0  39.0  0.727    41     1

# %in% and using local variable

In [26]:
condition=[0,2]
df.query('col8 in @condition').head()

    col1  col2  col3  col4  col5   col6  col7  col8
1     85    66    29     0  26.6  0.351    31     0
1     89    66    23    94  28.1  0.167    21     0
5    116    74     0     0  25.6  0.201    30     0
10   115     0     0     0  35.3  0.134    29     0
4    110    92     0     0  37.6  0.191    30     0

# group_by & summarise

In [13]:
df.query('col1 < 50').query('col2 > 50').\
groupby('col8').agg({'col1':'mean','col2':'mean'}).\

"""PIPE가 길어질 땐 주석으로 전처리 설명하기"""

query('col1 > 10')

SyntaxError: invalid syntax (<ipython-input-13-b1a30d564650>, line 1)

In [10]:
df.groupby('col8').apply(lambda x: (x.col1/(x.col1 +x.col2)).sum()).to_frame()

               0
col8
0     308.841581
1     178.488406

# distinct

In [124]:
df.groupby(['col8']).apply(lambda x: (x.col1+x.col2).mean()).to_frame().drop_duplicates()

              0
col8
0     178.16400
1     212.08209

# mute

In [151]:
df.assign(col1Pcol2=lambda x: x.col1 + x.col2).describe()

,col1,col2,col3,col4,col5,col6,col7,col8,col1Pcol2
count,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000
mean,120.894531,69.105469,20.536458,79.799479,31.992578,0.471876,33.240885,0.348958,190.000000
std,31.972618,19.355807,15.952218,115.244002,7.884160,0.331329,11.760232,0.476951,39.821571
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.078000,21.000000,0.000000,48.000000
25%,99.000000,62.000000,0.000000,0.000000,27.300000,0.243750,24.000000,0.000000,164.750000
50%,117.000000,72.000000,23.000000,30.500000,32.000000,0.372500,29.000000,0.000000,187.000000
75%,140.250000,80.000000,32.000000,127.250000,36.600000,0.626250,41.000000,1.000000,217.000000
max,199.000000,122.000000,99.000000,846.000000,67.100000,2.420000,81.000000,1.000000,299.000000

# transmute

In [153]:
df.assign(col1Pcol2=lambda x: x.col1 + x.col2)['col1Pcol2'].to_frame().head()

   col1Pcol2
6        220
1        151
8        247
1        155
0        177

# sort

In [157]:
df.assign(col1Pcol2=lambda x: x.col1 + x.col2)['col1Pcol2'].\
to_frame().sort_values('col1Pcol2',
                       ascending=False).head(10)

   col1Pcol2
4        299
0        293
7        286
6        282
9        281
6        277
8        276
1        275
7        274
8        274